---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures
source: html/d008a572-b1aa-1e46-0c4e-f760c50776fd.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures

Failures which give hints pointing to situations where performance could be improved.

## Syntax (C#)
```csharp
public static class PerformanceFailures
```